---
kind: type
id: T:Autodesk.Revit.DB.RadialArray
source: html/9264d95c-d206-a3c9-1759-b2eab38d3110.htm
---
# Autodesk.Revit.DB.RadialArray

An object that represents an Array created along a circle arc within the Revit project.

## Syntax (C#)
```csharp
public class RadialArray : BaseArray
```